[
  { "id": "em1", "scenario": "You are a student in Professor Kim's sociology class. Last week, you submitted your midterm essay via the class website. Yesterday, you checked your grade and were surprised to see it was much lower than you expected. When you opened the file that was graded, you realized it was an older draft, not the final version.", "direction": "Write an email to Professor Kim:", "goals": ["Explain the situation with your midterm essay submission", "Ask if you can resubmit the correct version", "Describe how this grade would affect your overall performance"], "to": "Professor Kim", "from": "You (Sociology 201)" },
  { "id": "em2", "scenario": "You recently saw a poster on campus for an international cultural exchange program. The program allows students to host visiting scholars and attend lectures by international faculty. You are interested but have questions.", "direction": "Write an email to the International Programs Office:", "goals": ["Express your interest in the program", "Ask specific questions about logistics", "Suggest an idea for a cultural activity"], "to": "International Programs Office", "from": "You (student)" },
  { "id": "em3", "scenario": "You subscribe to a poetry magazine called Verse & Voice. You tried to submit a poem through their online form last week, but the form gave an error after you clicked Submit. You are not sure if your poem was received.", "direction": "Write an email to the editor:", "goals": ["Tell the editor what you like about the magazine", "Describe the technical problem", "Ask about the status of your submission"], "to": "Editor, Verse & Voice", "from": "You (subscriber)" },
  { "id": "em4", "scenario": "You are a junior who recently completed an internship at a local environmental nonprofit. Your supervisor, Ms. Rivera, mentioned that the organization might offer a part-time position in the fall. You are very interested and want to follow up.", "direction": "Write an email to Ms. Rivera:", "goals": ["Thank her for the internship experience and mention something specific you learned", "Ask about the part-time position and your eligibility", "Explain how the role fits your academic and career goals"], "to": "Ms. Rivera, GreenFuture Nonprofit", "from": "You (former intern)" },
  { "id": "em5", "scenario": "Your university library recently changed its weekend hours, closing two hours earlier than before. As a student who works during the week, weekends are your main study time. You and several classmates are concerned.", "direction": "Write an email to the Library Director:", "goals": ["Explain why the old weekend hours were important to you", "Describe the impact of the change on your studies", "Propose a compromise or alternative solution"], "to": "Library Director", "from": "You (undergraduate student)" },
  { "id": "em6", "scenario": "You enrolled in a biology lab section that meets on Tuesdays and Thursdays. However, you just received your updated work schedule and now have a conflict on Thursdays. Another lab section is available on Wednesdays but is currently full.", "direction": "Write an email to the Biology Department:", "goals": ["Explain the scheduling conflict you are facing", "Request to be added to the Wednesday lab section", "Describe the consequences if you cannot resolve this issue"], "to": "Biology Department", "from": "You (Biology 110)" },
  { "id": "em7", "scenario": "Your dormitory has been experiencing frequent Wi-Fi outages over the past two weeks. You have an important online exam coming up next Monday and are worried about connectivity. Other residents on your floor have the same complaint.", "direction": "Write an email to the Campus IT Help Desk:", "goals": ["Describe the Wi-Fi problems you have been experiencing", "Explain why reliable internet is urgent for you right now", "Ask what steps are being taken and suggest a temporary solution"], "to": "IT Help Desk", "from": "You (Residence Hall student)" },
  { "id": "em8", "scenario": "You attended a guest lecture on campus last week by Dr. Thompson, a well-known marine biologist. The lecture inspired you and you are now considering changing your research topic for your senior thesis. You would like to contact Dr. Thompson for guidance.", "direction": "Write an email to Dr. Thompson:", "goals": ["Express your appreciation for the lecture and mention a specific point that resonated with you", "Explain how the lecture connects to your academic interests", "Ask if Dr. Thompson would be willing to provide brief advice or recommend resources"], "to": "Dr. Thompson", "from": "You (senior, Environmental Science)" }
]
